/**
 * Angol. 2024.07.10
 * Объекты
 * Знакомство с объектами (79)
 */

// массив. что означают элементы массива, мы не можем точно знать
// 3 элемент массива (24) может означать возраст или зароботок или еще что-нибудь.
const userArray = ['Вася', 'Пупкин', 24];

// объект:
const user = {
    // свойства объекта:
    name: 'Вася', // имя
    surname: 'Пупкин', // фамилия
    age: 24, // возраск
    skills: [ // массив скилов
        'Программирование',
        'Готовка'
    ],
    1: 1 // в качестве колюча могут быть строки, числа, символы
};
// так же у объекта бывают методы.
